[
    {
        "id": "a581f10microbio2a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Early Notions of Disease, Contagion, and Containment",
        "text": "Prehistoric humans had a very limited understanding of the causes of disease, and various cultures developed different beliefs and explanations. While many believed that illness was punishment for angering the gods or was simply the result of fate, archaeological evidence suggests that prehistoric people attempted to treat illnesses and $$infections$$. One example of this is Ötzi the Iceman, a 5300-year-old mummy found frozen in the ice of the Ötzal Alps on the Austrian-Italian border in $$1991$$. Because Ötzi was so well preserved by the ice, researchers discovered that he was infected with the eggs of the parasite Trichuris trichiura, which may have caused him to have abdominal pain and anemia. Researchers also found evidence of Borrelia burgdorferi, a bacterium that causes Lyme disease. Some researchers think Ötzi may have been trying to treat his infections with the woody fruit of the Fomitopsis betulinus fungus, which was discovered tied to his belongings.\\n\\nWhile it is unclear who exactly invented the microscope, a Dutch cloth merchant named Antonie van Leeuwenhoek $$(1632-1723)$$ was the first to develop a lens powerful enough to view microbes. In $$1675$$, using a simple but powerful microscope, Leeuwenhoek was able to observe single-celled organisms, which he described as “animalcules” or “wee little beasties,” swimming in a drop of rain water. From his drawings of these little organisms, we now know he was looking at bacteria and protists.\\n\\nMarcus Terentius Varro $$(116-27$$ BC) was a prolific Roman writer who was one of the first people to propose the concept that things we cannot see (what we now call microorganisms) can cause disease.\\n\\nRobert Koch $$(1843-1910)$$, a German physician, was the first to demonstrate the connection between a single, isolated microbe and a known human disease. For example, he discovered the bacteria that cause anthrax (Bacillus anthracis), cholera (Vibrio cholera), and tuberculosis (Mycobacterium tuberculosis).",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "https://creativecommons.org/licenses/by/4.0/ <CC BY 4.0>"
    }
]