[
    {
        "id": "a372017cramer27a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Determinant of 3x3 Matrix",
        "text": "Finding the determinant of a 2×2 matrix is straightforward, but finding the determinant of a 3×3 matrix is more complicated. One method is to augment the 3×3 matrix with a repetition of the first two columns, giving a 3×5 matrix. Then we calculate the sum of the products of entries down each of the three diagonals (upper left to lower right), and subtract the products of entries up each of the three diagonals (lower left to upper right). This is more easily understood with a visual and an example. \\\\n For a matrix $$A=\\begin{bmatrix} a_1 & b_1 & c_1 \\\\ a_2 & b_2 & c_2 \\\\ a_3 & b_3 & c_3 \\end{bmatrix}$$, \\\\n 1. Augment A with the first 2 columns, det(A)=|(a_1,b_1,c_1),(a_2,b_2,c_2),(a_3,b_3,c_3)|(a_1,b_1),(a_2,b_2),(a_3,b_3)| \\\\n 2. From upper left to lower right: Multiply the entries down the first diagonal. Add the result to the product of entries down the second diagonal. Add this result to the product of the entries down the third diagonal. \\\\n 3. From lower left to upper right: Subtract the product of entries up the first diagonal. From this result subtract the product of entries up the second diagonal. From this result, subtract the product of entries up the third diagonal. \\\\n The algebra is as follows: $$|A|=a_1 b_2 c_3+b_1 c_2 a_3+c_1 a_2 b_3-a_3 b_2 c_1-b_3 c_2 a_1-c_3 a_2 b_1$$\\n##figure1.gif##",
        "variabilization": {}
    },
    {
        "id": "a372017cramer27a-h2",
        "type": "hint",
        "dependencies": [
            "a372017cramer27a-h1"
        ],
        "title": "Properties of Determinants",
        "text": "1. If the matrix is in upper triangular form, the determinant equals the product of entries down the main diagonal. \\\\n 2. When two rows are interchanged, the determinant changes sign. \\\\n 3. If either two rows or two columns are identical, the determinant equals zero. \\\\n 4. If a matrix contains either a row of zeros or a column of zeros, the determinant equals zero. \\\\n 5. The determinant of an inverse matrix A-1 is the reciprocal of the determinant of the matrix A. \\\\n 6. If any row or column is multiplied by a constant, the determinant is multiplied by the same factor.",
        "variabilization": {}
    },
    {
        "id": "a372017cramer27a-h3",
        "type": "scaffold",
        "problemType": "TextBox",
        "answerType": "arithmetic",
        "hintAnswer": [
            "1"
        ],
        "dependencies": [
            "a372017cramer27a-h2"
        ],
        "title": "Finding D",
        "text": "We have that $$D=|(-1, 4, 0), (0, 2, -3), (0, 0, -3)|$$. Observe that the matrix is in upper triangular form. Which property, from 1 to 6, can we use here?",
        "variabilization": {}
    },
    {
        "id": "a372017cramer27a-h4",
        "type": "scaffold",
        "problemType": "TextBox",
        "answerType": "arithmetic",
        "hintAnswer": [
            "3"
        ],
        "dependencies": [
            "a372017cramer27a-h3"
        ],
        "title": "Finding D",
        "text": "What is D?",
        "variabilization": {}
    }
]