[
    {
        "id": "a70260fmentalhealth5a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Extrapyramidal Side Effects (EPS)",
        "text": "Extrapyramidal side effects are a group of symptoms that can occur in individuals taking certain medications, particularly antipsychotics. These symptoms are related to movement disorders.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a70260fmentalhealth5a-h2",
        "type": "hint",
        "dependencies": [
            "a70260fmentalhealth5a-h1"
        ],
        "title": "Types of Extrapyramidal Side Effects",
        "text": "EPS can include symptoms such as akathisia (a feeling of restlessness), dystonia (muscle contractions), tardive dyskinesia (involuntary movements), pseudo-Parkinson’s (Parkinson-like symptoms), and neuroleptic malignant syndrome (a severe reaction).",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a70260fmentalhealth5a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "drug induced movement disorders, like akathisia, dystonia, tardive dyskinesia, $$pseudo-Parkinson’s$$, and neuroleptic malignant syndrome"
        ],
        "dependencies": [
            "a70260fmentalhealth5a-h2"
        ],
        "title": "Identifying EPS in the Answer Choices",
        "text": "Look for the option that lists movement disorders as a side effect of medication.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "that dopamine hyperactivity in the brain’s mesolimbic pathway causes the positive symptoms of schizophrenia; that a hypofunction, formed in the early years of neurodevelopment in the NMDA receptors located on glutamatergic neurons is the cause of schizophrenia; hyperfunction (too much activity) at serotonin receptors",
            "drug induced movement disorders, like akathisia, dystonia, tardive dyskinesia, $$pseudo-Parkinson’s$$, and neuroleptic malignant syndrome",
            "potentially $$life-threatening$$ $$drug-drug$$ interaction; caused when high levels of serotonin are built up in the body. Signs and symptoms of serotonin syndrome include agitation, restlessness, insomnia, confusion, muscle rigidity, tachycardia, hypertension, dilated pupils, sweating, diarrhea, shivering, and headache",
            "$$time-limited$$ syndrome caused by sudden cessation or tapering too quickly off of an antidepressant"
        ]
    }
]