[
    {
        "id": "a70260fmentalhealth26a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Imaginal Exposure",
        "text": "Imaginal exposure is a therapeutic technique used in cognitive-behavioral therapy. It involves confronting fears in a controlled way.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a70260fmentalhealth26a-h2",
        "type": "hint",
        "dependencies": [
            "a70260fmentalhealth26a-h1"
        ],
        "title": "Purpose of Imaginal Exposure",
        "text": "The goal of imaginal exposure is to reduce the emotional response to a feared situation or memory by repeatedly confronting it in a safe environment.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a70260fmentalhealth26a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "mentally confronting and engaging with a feared situation, traumatic memory, or $$anxiety-provoking$$ thought in a safe and controlled environment"
        ],
        "dependencies": [
            "a70260fmentalhealth26a-h2"
        ],
        "title": "Identifying Imaginal Exposure",
        "text": "Which of the following best describes imaginal exposure?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "a sudden episode of intense fear or discomfort lasting several minutes or longer. During a panic attack, an individual may experience physical symptoms, such as sweating, trembling, heart palpitations, shortness of breath, and chest pain",
            "a complex interplay of genetic, neurobiological, and environmental factors contributes to the development of OCD",
            "excessive handwashing, excessive cleaning or organizing, compulsive counting, and repeatedly checking and rechecking the condition of objects, such as door locks, light switches, or electrical appliances",
            "mentally confronting and engaging with a feared situation, traumatic memory, or $$anxiety-provoking$$ thought in a safe and controlled environment"
        ]
    }
]