[
    {
        "id": "ab1327fautism3a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Applied Behavior Analysis",
        "text": "Applied Behavior Analysis (ABA) is a scientific approach that involves applying interventions to improve specific behaviors. It is often used to help individuals with autism spectrum disorder (ASD) by modifying behaviors and evaluating the effectiveness of these interventions.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "ab1327fautism3a-h2",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "process of systemically applying interventions to modify an individual's behavior and at the same time collecting data to evaluate the effect of each intervention on the individual's behavior"
        ],
        "dependencies": [
            "ab1327fautism3a-h1"
        ],
        "title": "Components of ABA",
        "text": "ABA involves two main components: 1) Systematically applying interventions to modify behavior, and 2) Collecting data to evaluate the effect of each intervention on the individual's behavior.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "process of systemically applying interventions to modify an individual's behavior and at the same time collecting data to evaluate the effect of each intervention on the individual's behavior",
            "working with young children and students with ASD on a variety of activities, spending more time with the student and can provide valuable insight into the student's strengths and areas of needs",
            "supporting a student's participation in $$school-related$$ routines and activities, including issues like coping with sensory issues, participating social activities",
            "helping students who have trouble with communication skills perform important learning and $$school-related$$ activities, like working on social communication"
        ]
    }
]