[
    {
        "id": "a1c7536mentalhealth4a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Personality Disorders",
        "text": "A personality disorder is more than just having a unique personality. It involves patterns that are significantly different from cultural expectations.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a1c7536mentalhealth4a-h2",
        "type": "hint",
        "dependencies": [
            "a1c7536mentalhealth4a-h1"
        ],
        "title": "Cultural Norms and Personality",
        "text": "Consider how a person's behavior might be viewed in the context of their cultural background. Does it align with or deviate from what is considered normal?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a1c7536mentalhealth4a-h3",
        "type": "hint",
        "dependencies": [
            "a1c7536mentalhealth4a-h2"
        ],
        "title": "Distress and Impairment",
        "text": "Think about whether the person's behavior causes them or others significant distress or impairs their ability to function in daily life.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a1c7536mentalhealth4a-h4",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "enduring patterns of thoughts, emotions, and behaviors that deviate significantly from cultural norms and cause significant distress and impairment in functioning"
        ],
        "dependencies": [
            "a1c7536mentalhealth4a-h3"
        ],
        "title": "Identifying Key Characteristics",
        "text": "What are the key characteristics that define a personality disorder?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "when they exhibit enduring patterns of thoughts, emotions, and behaviors that deviate significantly from cultural norms and these patterns cause significant distress and impairment in functioning",
            "genetics, brain changes, childhood trauma and abuse, cultural factors",
            "Patterns of thoughts, emotions, and actions that are ineffective or counterproductive to normal, everyday life"
        ]
    }
]