[
    {
        "id": "ab1327fautism12a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding the Role of Behavior Analysts",
        "text": "Board Certified Behavior Analysts (BCBAs) are professionals who specialize in behavior analysis. They work with individuals to improve their behavior through various interventions. But what exactly do they do?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "ab1327fautism12a-h2",
        "type": "hint",
        "dependencies": [
            "ab1327fautism12a-h1"
        ],
        "title": "Key Responsibilities of BCBAs",
        "text": "BCBAs are responsible for designing and implementing behavior intervention plans. They use data-driven methods to assess and modify behavior. Can you identify which option best describes their role?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "ab1327fautism12a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "they implement a process of systemically applying interventions to modify an individual's behavior and at the same time collecting data to evaluate the effect of each intervention on the individual's behavior"
        ],
        "dependencies": [
            "ab1327fautism12a-h2"
        ],
        "title": "Identifying the Correct Role",
        "text": "Which of the following best describes the role of a Board Certified Behavior Analyst?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "they implement a process of systemically applying interventions to modify an individual's behavior and at the same time collecting data to evaluate the effect of each intervention on the individual's behavior",
            "they work with students with ASD on a variety of activities, providing valuable insight into the student's strengths, areas of needs, interests, and other issues",
            "they develop and monitor appropriate feeding plans to address the nutritional needs of the child, as well as other feeding issues such as food preferences, food habits, and sensory issues"
        ]
    }
]