[
    {
        "id": "acb67bbchemeq8d-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Equilibrium",
        "text": "Equilibrium in a chemical reaction is reached when the rate of the forward reaction equals the rate of the reverse reaction. At this point, the concentrations of reactants and products remain constant over time.",
        "variabilization": {},
        "oer": "openai",
        "license": ""
    },
    {
        "id": "acb67bbchemeq8d-h2",
        "type": "hint",
        "dependencies": [
            "acb67bbchemeq8d-h1"
        ],
        "title": "Reaction Quotient (Q)",
        "text": "The reaction quotient, Q, is calculated using the same expression as the equilibrium constant, K, but with the current concentrations of reactants and products. Compare Q to K to determine the direction the reaction will proceed to reach equilibrium.",
        "variabilization": {},
        "oer": "openai",
        "license": ""
    },
    {
        "id": "acb67bbchemeq8d-h3",
        "type": "hint",
        "dependencies": [
            "acb67bbchemeq8d-h2"
        ],
        "title": "Comparing Q and K",
        "text": "If Q is less than K, the reaction will proceed in the forward direction to reach equilibrium. If Q is greater than K, the reaction will proceed in the reverse direction. If Q equals K, the system is at equilibrium.",
        "variabilization": {},
        "oer": "openai",
        "license": ""
    },
    {
        "id": "acb67bbchemeq8d-h4",
        "type": "hint",
        "dependencies": [
            "acb67bbchemeq8d-h3"
        ],
        "title": "Heterogeneous Equilibrium",
        "text": "In a heterogeneous equilibrium, only the concentrations of gases and aqueous solutions are included in the equilibrium expression. Solids and liquids are not included.",
        "variabilization": {},
        "oer": "openai",
        "license": ""
    },
    {
        "id": "acb67bbchemeq8d-h5",
        "type": "hint",
        "dependencies": [
            "acb67bbchemeq8d-h4"
        ],
        "title": "Solubility Product (Ksp)",
        "text": "The solubility product constant, Ksp, is used for sparingly soluble salts. It is the product of the concentrations of the ions, each raised to the power of their coefficients in the balanced equation.",
        "variabilization": {},
        "oer": "openai",
        "license": ""
    }
]