[
    {
        "id": "a70260fmentalhealth25a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding OCD Compulsions",
        "text": "Obsessive-compulsive disorder (OCD) is characterized by unwanted and intrusive thoughts (obsessions) and repetitive behaviors (compulsions). These compulsions are performed in an attempt to reduce anxiety or prevent a feared event or situation.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a70260fmentalhealth25a-h2",
        "type": "hint",
        "dependencies": [
            "a70260fmentalhealth25a-h1"
        ],
        "title": "Common Compulsions in OCD",
        "text": "Compulsions in OCD often involve repetitive actions that are performed in a specific way or order. These actions are usually aimed at preventing or reducing distress or preventing a feared event or situation.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a70260fmentalhealth25a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "excessive handwashing, excessive cleaning or organizing, compulsive counting, and repeatedly checking and rechecking the condition of objects, such as door locks, light switches, or electrical appliances"
        ],
        "dependencies": [
            "a70260fmentalhealth25a-h2"
        ],
        "title": "Identifying Compulsions",
        "text": "Which of the following are considered compulsions in OCD?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "a sudden episode of intense fear or discomfort lasting several minutes or longer. During a panic attack, an individual may experience physical symptoms, such as sweating, trembling, heart palpitations, shortness of breath, and chest pain",
            "a complex interplay of genetic, neurobiological, and environmental factors contributes to the development of OCD",
            "excessive handwashing, excessive cleaning or organizing, compulsive counting, and repeatedly checking and rechecking the condition of objects, such as door locks, light switches, or electrical appliances",
            "mentally confronting and engaging with a feared situation, traumatic memory, or $$anxiety-provoking$$ thought in a safe and controlled environment"
        ]
    }
]