[
    {
        "id": "adf3b8edatapresentation23a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Identify the Testing Objective",
        "text": "When testing your presentation, it's important to know what you want to achieve with the feedback. Are you trying to gauge the clarity of your messages or perhaps the engagement of your audience? Reflect on what aspect of your presentation you want to test most effectively.",
        "variabilization": {},
        "oer": "openai",
        "license": ""
    },
    {
        "id": "adf3b8edatapresentation23a-h2",
        "type": "hint",
        "dependencies": [
            "adf3b8edatapresentation23a-h1"
        ],
        "title": "Consider the Audience's Perspective",
        "text": "Think about the experiences of those who will see your presentation. What would they describe as key takeaways? Insight into their understanding can highlight if your intended message is being clearly communicated.",
        "variabilization": {},
        "oer": "openai",
        "license": ""
    },
    {
        "id": "adf3b8edatapresentation23a-h3",
        "type": "hint",
        "dependencies": [
            "adf3b8edatapresentation23a-h2"
        ],
        "title": "Assessing Impact",
        "text": "After presenting, it can be helpful to verify whether your audience's impressions match your original intent. Consider how you'd confirm this alignment effectively.",
        "variabilization": {},
        "oer": "openai",
        "license": ""
    },
    {
        "id": "adf3b8edatapresentation23a-h4",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "Ask colleagues, friends, etc., to tell you what they've learned from your presentation and see if that aligns with your intent"
        ],
        "dependencies": [
            "adf3b8edatapresentation23a-h3"
        ],
        "title": "Implement Direct Feedback",
        "text": "Getting feedback directly from peers or your audience can be very telling. Ask them what they've understood and learned. Compare their feedback with your original objectives.",
        "variabilization": {},
        "oer": "openai",
        "license": "",
        "choices": [
            "Ask colleagues, friends, etc., to give your presentation and ask yourself if it works",
            "Ask colleagues, friends, etc., to tell you what they've learned from your presentation and see if that aligns with your intent",
            "Ask colleagues, friends, etc., to review your presentation on a scale from $$0-5$$ across six dimensions",
            "Ask colleagues, friends, etc., to tell you whether they like your presentation"
        ]
    }
]