[
    {
        "id": "a1c7536mentalhealth16a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Borderline Personality Disorder",
        "text": "Borderline personality disorder is a mental health condition characterized by a specific pattern of behavior and emotional instability. It is important to recognize the key features that define this disorder.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a1c7536mentalhealth16a-h2",
        "type": "hint",
        "dependencies": [
            "a1c7536mentalhealth16a-h1"
        ],
        "title": "Key Features of Borderline Personality Disorder",
        "text": "Consider the emotional and behavioral patterns that are typically associated with borderline personality disorder. These often include instability in relationships, self-image, and emotions, as well as impulsive actions.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a1c7536mentalhealth16a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "a pervasive pattern of instability of interpersonal relationships, $$self-image$$, and affects, and marked impulsivity that begins by early adulthood and is present in a variety of contexts"
        ],
        "dependencies": [
            "a1c7536mentalhealth16a-h2"
        ],
        "title": "Identifying the Correct Pattern",
        "text": "Which of the following options best describes the pattern of behavior and emotional instability associated with borderline personality disorder?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "idea that one can influence the outcome of specific events by doing something that has no bearing on the circumstances",
            "a pervasive pattern of disregard for, and violation of, the rights of others that begins in childhood or early adolescence and continues into adulthood",
            "a pervasive pattern of instability of interpersonal relationships, $$self-image$$, and affects, and marked impulsivity that begins by early adulthood and is present in a variety of contexts",
            "a pattern of pervasive and excessive emotionality and $$attention-seeking$$ behavior that begins by early adulthood and is present in a variety of contexts"
        ]
    }
]