[
    {
        "id": "abaec3amentalhealth16a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding the ANA's Position",
        "text": "The American Nurses Association (ANA) has a clear stance on the involvement of nurses in physician-assisted suicide. Consider the ethical principles and standards that guide the nursing profession.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "abaec3amentalhealth16a-h2",
        "type": "hint",
        "dependencies": [
            "abaec3amentalhealth16a-h1"
        ],
        "title": "Ethical Principles in Nursing",
        "text": "Think about the core ethical principles that nurses are expected to uphold. How might these principles influence their participation in physician-assisted suicide?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "abaec3amentalhealth16a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "The American Nurses Association (ANA) states that nurses should not participate in assisted suicide, even in jurisdictions where it is legal, because it is inconsistent with the ethical principles and standards of the nursing profession"
        ],
        "dependencies": [
            "abaec3amentalhealth16a-h2"
        ],
        "title": "ANA's Ethical Standards",
        "text": "What does the ANA say about the consistency of physician-assisted suicide with the ethical standards of nursing?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "Open and empathetic dialogue can serve as a powerful tool for risk assessment and therapeutic intervention. Conducting conversations with a nonjudgmental approach, employing $$open-ended$$ questions, and actively listening to the client’s narrative are all techniques that may allow the client to feel comfortable enough to share sensitive information",
            "The American Nurses Association (ANA) states that nurses should not participate in assisted suicide, even in jurisdictions where it is legal, because it is inconsistent with the ethical principles and standards of the nursing profession",
            "skill of applying $$evidence-based$$ nursing care in agreement with the cultural values, beliefs, worldview, and practices of clients to produce improved client outcomes"
        ]
    }
]