[
    {
        "id": "aeff097mentalhealth1a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Schizophrenia",
        "text": "Schizophrenia is a complex mental disorder that affects how a person thinks, feels, and behaves. It is characterized by a range of symptoms that can include delusions, hallucinations, disorganized thinking, and impaired functioning.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "aeff097mentalhealth1a-h2",
        "type": "hint",
        "dependencies": [
            "aeff097mentalhealth1a-h1"
        ],
        "title": "Symptoms of Schizophrenia",
        "text": "Common symptoms of schizophrenia include hallucinations, delusions, disorganized speech, and impaired cognitive ability. These symptoms can significantly impact a person's ability to function in daily life.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "aeff097mentalhealth1a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "severe mental illness and disturbance involving a collection of cognitive, affective, and behavioral symptoms that negatively affect social, educational, and/or occupational functioning"
        ],
        "dependencies": [
            "aeff097mentalhealth1a-h2"
        ],
        "title": "Defining Schizophrenia",
        "text": "Schizophrenia is a severe mental illness and disturbance involving a collection of cognitive, affective, and behavioral symptoms that negatively affect social, educational, and/or occupational functioning.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "severe mental illness and disturbance involving a collection of cognitive, affective, and behavioral symptoms that negatively affect social, educational, and/or occupational functioning",
            "hyperactivity of dopamine in the mesolimbic pathway of the brain; that due to genetic $$influences$$, changes in utero, or during critical neurodevelopmental stages, a hypofunction occurs in the $$N-methyl-D-aspartate$$ (NMDA) receptors on glutamatergic neurons; hyper function of the neurotransmitter serotonin and its receptors",
            "a severe mental condition where a person loses the ability to recognize reality or has lost contact with external reality, causing a loss of function and disorganization of personality"
        ]
    }
]