[
    {
        "id": "abaec3amentalhealth22a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Collectivism",
        "text": "Collectivism is a cultural value that emphasizes the importance of the group over individual interests. It often involves prioritizing community goals and cooperation.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "abaec3amentalhealth22a-h2",
        "type": "hint",
        "dependencies": [
            "abaec3amentalhealth22a-h1"
        ],
        "title": "Characteristics of Collectivist Cultures",
        "text": "In collectivist cultures, decisions are often made for the benefit of the group. The needs of the community are prioritized over individual desires.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "abaec3amentalhealth22a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "cultures that emphasize community and cooperation. Decisions are made for the benefit of the collective. These cultures believe that it is best for society when everyone works together as a group, and the needs of the individual come secondary to the needs of the greater good."
        ],
        "dependencies": [
            "abaec3amentalhealth22a-h2"
        ],
        "title": "Identifying Collectivism",
        "text": "Which of the following best describes collectivism?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "when an individual’s cultural beliefs are integrated into their health care",
            "set of beliefs, attitudes, and practices shared by a group of people or community that is accepted, followed, and passed down to other members of the group",
            "individuals are encouraged to make choices for their own benefit with an emphasis on independence and $$self-reliance$$, and health care tends to be viewed as a personal responsibility. Most Western countries, such as the United States, United Kingdom, and other parts of Western Europe are considered to have individualistic cultures",
            "cultures that emphasize community and cooperation. Decisions are made for the benefit of the collective. These cultures believe that it is best for society when everyone works together as a group, and the needs of the individual come secondary to the needs of the greater good."
        ]
    }
]