[
    {
        "id": "ae1f7a39.3distributionchoicea-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Z-test",
        "text": "Recall what decisions must be made to decide what distribution would be best to perform hypothesis tests. When you use a normal distribution for a hypothesis test (often called a z-test), a simple random sample is taken from the population and the population that you are working with is normally distributed or the sample size is sufficiently large.",
        "variabilization": {}
    },
    {
        "id": "ae1f7a39.3distributionchoicea-h2",
        "type": "hint",
        "dependencies": [
            "ae1f7a39.3distributionchoicea-h1"
        ],
        "title": "T-test",
        "text": "When you perform a hypothesis test of a single population mean μ using a Student's t-distribution (often called a t-test), there are fundamental assumptions that need to be met in order for the test to work properly. Your data should be a simple random sample that comes from a population that is approximately normally distributed. You use the sample standard deviation to approximate the population standard deviation.",
        "variabilization": {}
    },
    {
        "id": "ae1f7a39.3distributionchoicea-h3",
        "type": "hint",
        "dependencies": [
            "ae1f7a39.3distributionchoicea-h2"
        ],
        "title": "Exponential Distributions",
        "text": "Exponential distributions involves a continuous random variable that appears when we are interested inthe intervals of time between some random events. Take for example, the length of time between emergnecy arrivals at a hospital.",
        "variabilization": {}
    },
    {
        "id": "ae1f7a39.3distributionchoicea-h4",
        "type": "hint",
        "dependencies": [
            "ae1f7a39.3distributionchoicea-h3"
        ],
        "title": "Hypothesis Testing Distributions",
        "text": "Exponential distributions cannot be used for hypothesis testing, the only eligible distributions are normal and t-test distributions.",
        "variabilization": {}
    },
    {
        "id": "ae1f7a39.3distributionchoicea-h5",
        "type": "hint",
        "dependencies": [
            "ae1f7a39.3distributionchoicea-h4"
        ],
        "title": "Hypothesis Testing Distributions",
        "text": "We can either choose normal or t-test distribution. Although the data in this context is approximately normal and we could use normal distribution, since we are unaware of the population standard deviation, the t-test is the best choice for this hypothesis testing scenario.",
        "variabilization": {}
    }
]