[
    {
        "id": "a8c23acmentalhealth4a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Withdrawal",
        "text": "Withdrawal refers to the physical and emotional symptoms that occur when a person stops using a substance they are dependent on. It is a key indicator of substance use disorder.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a8c23acmentalhealth4a-h2",
        "type": "hint",
        "dependencies": [
            "a8c23acmentalhealth4a-h1"
        ],
        "title": "Recognizing Withdrawal Symptoms",
        "text": "Common withdrawal symptoms include anxiety, irritability, fatigue, nausea, and changes in mood or appetite. These symptoms can vary depending on the substance used.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a8c23acmentalhealth4a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "the person begins to feel physical or emotional upset when they are not using a substance"
        ],
        "dependencies": [
            "a8c23acmentalhealth4a-h2"
        ],
        "title": "Identifying the Correct Definition",
        "text": "Which of the following best describes withdrawal?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "when the person continues to use substances, the neurotransmitters adapt, and the person demonstrates a reduced response to the substance and requires more of the substance to feel an effect; this is called tolerance (U.S. Department of Health and Human Services",
            "paranoia, hallucinations, and agitation, along with elevated body temperature, cardiac dysrhythmias, altered blood pressure, and seizures",
            "repeated use of alcohol and/or other drugs significantly impairs a person’s health and results in an inability for them to meet major responsibilities at work, school, or home",
            "a psychoactive compound with the potential for dependence and detrimental effects",
            "the person begins to feel physical or emotional upset when they are not using a substance"
        ]
    }
]