[
    {
        "id": "a372017cramer25a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Cramer's Rule for 3x3 Systems",
        "text": "We can apply Cramer’s Rule to solve a system of three equations in three variables. Cramer’s Rule is straightforward, following a pattern consistent with Cramer’s Rule for 2 × 2 matrices. Consider a 3x3 system of equations. $$a_1 x+b_1 y+c_1 z=d_1$$ $$a_2 x+b_2 y+c_2 z=d_2$$ $$a_3 x+b_3 y+c_3 z=d_3$$ $$x=\\frac{D_x}{D}$$, $$y=\\frac{D_y}{D}$$, $$z=\\frac{D_z}{D}$$, $$D!=0$$ If we are writing the determinant $$D_x$$, we replace the x column with the constant column. If we are writing the determinant $$D_y$$, we replace the y column with the constant column. If we are writing the determinant $$D_z$$, we replace the z column with the constant column.\\n##figure1.gif##",
        "variabilization": {}
    },
    {
        "id": "a372017cramer25a-h2",
        "type": "hint",
        "dependencies": [
            "a372017cramer25a-h1"
        ],
        "title": "Determinant of 3x3 Matrix",
        "text": "Finding the determinant of a 2×2 matrix is straightforward, but finding the determinant of a 3×3 matrix is more complicated. One method is to augment the 3×3 matrix with a repetition of the first two columns, giving a 3×5 matrix. Then we calculate the sum of the products of entries down each of the three diagonals (upper left to lower right), and subtract the products of entries up each of the three diagonals (lower left to upper right). This is more easily understood with a visual and an example. For a matrix $$A=\\begin{bmatrix} a_1 & b_1 & c_1 \\\\ a_2 & b_2 & c_2 \\\\ a_3 & b_3 & c_3 \\end{bmatrix}$$, 1. Augment A with the first 2 columns, det(A)=|(a_1,b_1,c_1),(a_2,b_2,c_2),(a_3,b_3,c_3)|(a_1,b_1),(a_2,b_2),(a_3,b_3)| 2. From upper left to lower right: Multiply the entries down the first diagonal. Add the result to the product of entries down the second diagonal. Add this result to the product of the entries down the third diagonal. 3. From lower left to upper right: Subtract the product of entries up the first diagonal. From this result subtract the product of entries up the second diagonal. From this result, subtract the product of entries up the third diagonal. The algebra is as follows: $$|A|=a_1 b_2 c_3+b_1 c_2 a_3+c_1 a_2 b_3-a_3 b_2 c_1-b_3 c_2 a_1-c_3 a_2 b_1$$\\n##figure2.gif##",
        "variabilization": {}
    },
    {
        "id": "a372017cramer25a-h3",
        "type": "hint",
        "dependencies": [
            "a372017cramer25a-h2"
        ],
        "title": "Properties of Determinants",
        "text": "1. If the matrix is in upper triangular form, the determinant equals the product of entries down the main diagonal. 2. When two rows are interchanged, the determinant changes sign. 3. If either two rows or two columns are identical, the determinant equals zero. 4. If a matrix contains either a row of zeros or a column of zeros, the determinant equals zero. 5. The determinant of an inverse matrix A-1 is the reciprocal of the determinant of the matrix A. 6. If any row or column is multiplied by a constant, the determinant is multiplied by the same factor.",
        "variabilization": {}
    },
    {
        "id": "a372017cramer25a-h4",
        "type": "scaffold",
        "problemType": "TextBox",
        "answerType": "arithmetic",
        "hintAnswer": [
            "3"
        ],
        "dependencies": [
            "a372017cramer25a-h3"
        ],
        "title": "Finding D",
        "text": "Using Cramer's Rule, we have that $$D=|(2, 4, 4), (3, 7, 7), (1, 2, 2)|$$. Observe that the second and third columns are identical. Which property, from 1 to 6, can we use here?",
        "variabilization": {}
    },
    {
        "id": "a372017cramer25a-h5",
        "type": "scaffold",
        "problemType": "TextBox",
        "answerType": "arithmetic",
        "hintAnswer": [
            "0"
        ],
        "dependencies": [
            "a372017cramer25a-h4"
        ],
        "title": "Finding D",
        "text": "What is D?",
        "variabilization": {}
    },
    {
        "id": "a372017cramer25a-h6",
        "type": "hint",
        "dependencies": [
            "a372017cramer25a-h5"
        ],
        "title": "Determinant of Zero",
        "text": "A determinant of zero means that either the system has no solution or it has an $$infinite$$ number of solutions. We use the process of elimination to see which one.",
        "variabilization": {}
    },
    {
        "id": "a372017cramer25a-h7",
        "type": "hint",
        "dependencies": [
            "a372017cramer25a-h6"
        ],
        "title": "Eliminating Terms",
        "text": "When there are like terms in both equation, we can add or subtract the common terms so that we are left with only one variable that we can solve.",
        "variabilization": {}
    },
    {
        "id": "a372017cramer25a-h8",
        "type": "hint",
        "dependencies": [
            "a372017cramer25a-h7"
        ],
        "title": "Eliminating Terms",
        "text": "Multiply the third equation by -2 and add the result to the first equation.",
        "variabilization": {}
    },
    {
        "id": "a372017cramer25a-h9",
        "type": "hint",
        "dependencies": [
            "a372017cramer25a-h8"
        ],
        "title": "Interpreting the Solution",
        "text": "Adding the scaled third equation with the first equation, we obtain the equation $$0=-6$$, which is false. Therefore, the system has no solution..",
        "variabilization": {}
    }
]