[
    {
        "id": "a1c7536mentalhealth17a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding Histrionic Personality Disorder",
        "text": "Histrionic personality disorder is characterized by a pattern of behavior that is often dramatic and attention-seeking. It is important to recognize the key traits that define this disorder.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a1c7536mentalhealth17a-h2",
        "type": "hint",
        "dependencies": [
            "a1c7536mentalhealth17a-h1"
        ],
        "title": "Key Characteristics",
        "text": "Individuals with histrionic personality disorder often exhibit excessive emotionality and a strong desire for attention. They may feel uncomfortable when they are not the center of attention.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a1c7536mentalhealth17a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "a pattern of pervasive and excessive emotionality and $$attention-seeking$$ behavior that begins by early adulthood and is present in a variety of contexts"
        ],
        "dependencies": [
            "a1c7536mentalhealth17a-h2"
        ],
        "title": "Identifying the Correct Pattern",
        "text": "Which of the following patterns best describes histrionic personality disorder?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "idea that one can influence the outcome of specific events by doing something that has no bearing on the circumstances",
            "a pervasive pattern of disregard for, and violation of, the rights of others that begins in childhood or early adolescence and continues into adulthood",
            "a pervasive pattern of instability of interpersonal relationships, $$self-image$$, and affects, and marked impulsivity that begins by early adulthood and is present in a variety of contexts",
            "a pattern of pervasive and excessive emotionality and $$attention-seeking$$ behavior that begins by early adulthood and is present in a variety of contexts"
        ]
    }
]