[
    {
        "id": "a70260fmentalhealth24a-h1",
        "type": "hint",
        "dependencies": [],
        "title": "Understanding OCD",
        "text": "Obsessive-Compulsive Disorder (OCD) is a mental health condition characterized by persistent, unwanted thoughts (obsessions) and repetitive behaviors (compulsions).",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a70260fmentalhealth24a-h2",
        "type": "hint",
        "dependencies": [
            "a70260fmentalhealth24a-h1"
        ],
        "title": "Factors Contributing to OCD",
        "text": "Consider the different factors that might contribute to the development of OCD. Think about genetic, neurobiological, and environmental $$influences$$.",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": ""
    },
    {
        "id": "a70260fmentalhealth24a-h3",
        "type": "scaffold",
        "problemType": "MultipleChoice",
        "answerType": "string",
        "hintAnswer": [
            "a complex interplay of genetic, neurobiological, and environmental factors contributes to the development of OCD"
        ],
        "dependencies": [
            "a70260fmentalhealth24a-h2"
        ],
        "title": "Identifying the Correct Answer",
        "text": "Which of the following options best describes the causes of OCD?",
        "variabilization": {},
        "oer": "https://OATutor.io <OATutor>",
        "license": "",
        "choices": [
            "a sudden episode of intense fear or discomfort lasting several minutes or longer. During a panic attack, an individual may experience physical symptoms, such as sweating, trembling, heart palpitations, shortness of breath, and chest pain",
            "a complex interplay of genetic, neurobiological, and environmental factors contributes to the development of OCD",
            "excessive handwashing, excessive cleaning or organizing, compulsive counting, and repeatedly checking and rechecking the condition of objects, such as door locks, light switches, or electrical appliances",
            "mentally confronting and engaging with a feared situation, traumatic memory, or $$anxiety-provoking$$ thought in a safe and controlled environment"
        ]
    }
]